Reports/РасчетыСКлиентамиПоСвойствам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Report>
		<Properties>
			<Name>РасчетыСКлиентамиПоСвойствам</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Свойство</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.СвойстваКлиентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗначениеСвойства</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.СвойстваКлиентов</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

AccumulationRegisters/Покупатели.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<AccumulationRegister>
		<Properties>
			<Name>Покупатели</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Долг</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НаборСвойств</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВариантыКлиентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

InformationRegisters/ЗначенияСвойствКлиентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>ЗначенияСвойствКлиентов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.СвойстваКлиентов</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>НаборСвойств</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВариантыКлиентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидСвойства</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.СвойстваКлиентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Reports/РасчетыСКлиентамиПоСвойствам/Forms/ФормаОтчета/Ext/Form/Module.bsl
&НаКлиенте
Процедура КомандаСформиоватьОтчет(Команда)
	Отчет();
КонецПроцедуры

&НаСервере
Процедура Отчет()
	
		
//1. Предварительный этап
	ТабДок = ТабличныйДокумент; //указываем тип выходных данных
	ТабДок.Очистить();//очищаем на случай повторной формировки
	ТабДок.ТолькоПросмотр=Истина;//даем право только на просмотр
	
//2. Получаем созданный ранее макет с помощью вспомогательной процедуры
	Макет = ПолучитьМакетНаСервере("Макет"); 
	
//2.1. Получаем области макета и выводим их
	ОбластьЗаголовок = Макет.ПолучитьОбласть("ОбластьЗаголовок");
	ТабДок.Вывести(ОбластьЗаголовок);
	
	ОбластьШапка = Макет.ПолучитьОбласть("ОбластьШапка");
	ТабДок.Вывести(ОбластьШапка);
	
	ОбластьДанные = Макет.ПолучитьОбласть("ОбластьДанные");
	
//2.1.1 Получаем данные для вывода в отчет
	ЗапросДанных = Новый Запрос;
	ЗапросДанных.Текст =    
	
	"ВЫБРАТЬ
	|	ПокупателиОстаткиИОбороты.Клиент КАК Клиент,
	|	ПокупателиОстаткиИОбороты.НаборСвойств КАК НаборСвойств,
	|	ПокупателиОстаткиИОбороты.ДолгНачальныйОстаток КАК ДолгНачальныйОстаток,
	|	ПокупателиОстаткиИОбороты.ДолгКонечныйОстаток КАК ДолгКонечныйОстаток,
	|	ПокупателиОстаткиИОбороты.ДолгПриход КАК ДолгПриход,
	|	ПокупателиОстаткиИОбороты.ДолгРасход КАК ДолгРасход
	|ИЗ
	|	РегистрНакопления.Покупатели.ОстаткиИОбороты (, , , , НаборСвойств В 
	|		(ВЫБРАТЬ
	|			ЗначенияСвойствКлиентов.НаборСвойств КАК НаборСвойств 
	|       ИЗ
	|			РегистрСведений.ЗначенияСвойствКлиентов КАК ЗначенияСвойствКлиентов
	|		ГДЕ   ";
				Если не Отчет.Клиент.Пустая() Тогда
					ЗапросДанных.Текст = ЗапросДанных.Текст +
				"ЗначенияСвойствКлиентов.НаборСвойств.Владелец = &Клиент
	|			И";
				КонецЕсли;
				ЗапросДанных.Текст = ЗапросДанных.Текст + 
				" ЗначенияСвойствКлиентов.ВидСвойства = &ВидСвойства
	|			И ЗначенияСвойствКлиентов.Значение = &Значение ))
	|			КАК ПокупателиОстаткиИОбороты
	|
	|УПОРЯДОЧИТЬ ПО
	|	Клиент";   
				
	Если Не Отчет.Клиент.Пустая()Тогда 
		ЗапросДанных.УстановитьПараметр("Клиент", Отчет.Клиент);
	КонецЕсли;
	
	ЗапросДанных.УстановитьПараметр("ВидСвойства", Отчет.Свойство);
	ЗапросДанных.УстановитьПараметр("Значение", Отчет.ЗначениеСвойства);
	
	ВыборкаДанных = ЗапросДанных.Выполнить().Выбрать();
	
	//2.1.2 Тут будет производиться заполнение полученных данных 
	Пока ВыборкаДанных.Следующий() Цикл 
		ОбластьДанные.Параметры.Клиенты = ВыборкаДанных.Клиент; 
		ОбластьДанные.Параметры.НаборСвойствКлиентов = ВыборкаДанных.НаборСвойств; 
		ОбластьДанные.Параметры.ДолгНачальныйОстаток = ВыборкаДанных.ДолгНачальныйОстаток; 
		ОбластьДанные.Параметры.ДолгПриход = ВыборкаДанных.ДолгПриход; 
		ОбластьДанные.Параметры.ДолгРасход = ВыборкаДанных.ДолгРасход; 
		ОбластьДанные.Параметры.ДолгКонечныйОстаток = ВыборкаДанных.ДолгКонечныйОстаток; 
		ТабДок.Вывести(ОбластьДанные, ВыборкаДанных.Уровень()); 
	КонецЦикла; 
	
	ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ТабДок.МасштабПечати = 100;
	
	ТабДок.РазмерСтраницы = "A4";
	ТабДок.ТочностьПечати = ТочностьПечати.Точная;


	
	
	
КонецПроцедуры

//ВСПОМОГАТЕЛЬНОЕ

&НаСервере
Функция ПолучитьМакетНаСервере(ИмяМакета)
	
	ЭО=РеквизитФормыВЗначение("Отчет");  
	Макет=ЭО.ПолучитьМакет(ИмяМакета);
	Возврат Макет;
	
КонецФункции
